/*
* [일곱 난쟁이]
돌아온 난쟁이가 일곱 명이 아닌 아홉 명이었던 것이다.
다행스럽게도 일곱 난쟁이의 키의 합이 100이 됨을 기억해 냈다.
아홉 난쟁이의 키가 주어졌을 때, 백설공주를 도와 일곱 난쟁이를 찾는 프로그램을 작성하시오.
입력사항>>주어지는 키는 100을 넘지 않는 자연수이며, 아홉 난쟁이의 키는 모두 다르며, 
>>가능한 정답이 여러 가지인 경우에는 아무거나 출력한다.
출력시>>일곱 난쟁이의 키를 오름차순으로 출력한다. 일곱 난쟁이를 찾을 수 없는 경우는 없다.
*/
/*[구조도]
* 먼저 9개 난쟁이 > 배열[9]
* 입력> int *pointer
* 조건문 > 논리 구조 어떻게 해야하지??????
* 논리구조 아이디어
* 1. 9개 sum 하고 두개 뺴기 >>두개 어떻게 뺄건데....
*	[채택]1.1 전부 sum 때리고 [1][2]> [1][3]>[1][4] >>>>[2][3]>[2][4]>>[3][4] 
* 2. 일단 숫자순 정렬 때리고 큰거부터 더하기로 할까
*	2.1 숫자순 정렬 때리고 큰거부터 더하다가 if 문 사용해서 
* 
*/
#include<stdio.h>

int main(void) {
	int i = 0;
	

	return 0;
}